src_doc/Catalogs/Мероприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Мероприятия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ДокументыПредприятия</xr:Item>
				<xr:Item>Catalog.Мероприятия</xr:Item>
				<xr:Item>Catalog.Проекты</xr:Item>
				<xr:Item>Document.ВходящееПисьмо</xr:Item>
				<xr:Item>Document.ИсходящееПисьмо</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.КонтактныеЛица</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМероприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрифДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрифыДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МатериалПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МатериалПротокол</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПроведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизаторКонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Папка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПапкиМероприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение подготовившего</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииИПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Председатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущееМероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секретарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрограммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПрограммыПротокола</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПротокола</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПрограммыПротокола</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Программа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ЛичныеАдресаты</v8:Type>
								<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПункта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетПринятияРешения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Протокол</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПунктаПрограммы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктПротокола</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПротоколыМероприятий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_doc/CommonModules/РаботаСИнтегрированнымиСистемамиПереопределяемый/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается при определении списка обязательных для заполнения реквизитов объекта ДО.
//
// Параметры:
//   ОбязательныеРеквизиты - см. Справочники.ПравилаЗагрузкиДанныхВДО.КоллекцияРеквизитовОбъектаДО
//   ТипОбъектаДО - Строка - имя типа объекта Документооборота.
//   ВидДокументаОбъект - СправочникОбъект.ВидыДокументов - вид документа.
//
Процедура ПриОпределенииОбязательныхРеквизитовОбъектаДО(ОбязательныеРеквизиты, ТипОбъектаДО, ВидДокументаОбъект) Экспорт
	
	Если ТипОбъектаДО = "Справочник.ДокументыПредприятия" Тогда
		
		НоваяСтрока = ОбязательныеРеквизиты.Добавить();
		НоваяСтрока.Имя = "Получатель";
		
		НоваяСтрока = ОбязательныеРеквизиты.Добавить();
		НоваяСтрока.Имя = "Организация";
		
		НоваяСтрока = ОбязательныеРеквизиты.Добавить();
		НоваяСтрока.Имя = "ФормаДокумента";
		
		Если ВидДокументаОбъект <> Неопределено Тогда
			Если ВидДокументаОбъект.ВестиУчетПоАдресатам Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Адресат";
			КонецЕсли;
			
			// Локализация
			Если ВидДокументаОбъект.ЯвляетсяОбращениемОтГраждан Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "ВидОбращения";
			КонецЕсли;
			// Локализация Конец
			
			Если ВидДокументаОбъект.ВестиУчетПоСтатьямДДС Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "СтатьиДДС";
				НоваяСтрока.ЭтоТаблица = Истина;
				НоваяСтрока.Таблица = "";
				
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "СтатьяДвиженияДенежныхСредств";
				НоваяСтрока.Таблица = "СтатьиДДС";
			КонецЕсли;
			
			Если ВидДокументаОбъект.ОбязательноеУказаниеОтветственного Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Ответственный";
			КонецЕсли;
			
			Если ВидДокументаОбъект.ОбязательноУказаниеПроекта Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Проект";
			КонецЕсли;
			
			Если ВидДокументаОбъект.ВестиУчетПоТематикам Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Тематика";
			КонецЕсли;
			
			Если ВидДокументаОбъект.ЯвляетсяВходящейКорреспонденцией
					Или ВидДокументаОбъект.ЯвляетсяИсходящейКорреспонденцией Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Контрагент";
			КонецЕсли;
			
			Если ВидДокументаОбъект.ВестиУчетПоКонтрагентам Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Контрагенты";
				НоваяСтрока.ЭтоТаблица = Истина;
				НоваяСтрока.Таблица = "";
				
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Контрагент";
				НоваяСтрока.Таблица = "Контрагенты";
			КонецЕсли;
			
			Если ВидДокументаОбъект.ВестиУчетСторон И Не ВидДокументаОбъект.ЯвляетсяЗаявкойНаОплату Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Стороны";
				НоваяСтрока.ЭтоТаблица = Истина;
				НоваяСтрока.Таблица = "";
			КонецЕсли;
			
			Если ВидДокументаОбъект.ЯвляетсяЗаявкойНаОплату Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Сумма";
			КонецЕсли;
			
			Если ВидДокументаОбъект.УчитыватьСрокДействия Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "ДатаНачалаДействия";
				
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "ДатаОкончанияДействия";
				
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "ПорядокПродления";
			КонецЕсли;
			
			Если ПолучитьФункциональнуюОпцию("ИспользоватьСуммуВоВнутренних",
					Новый Структура("ВидДокумента", ВидДокументаОбъект.Ссылка)) Тогда
				НоваяСтрока = ОбязательныеРеквизиты.Добавить();
				НоваяСтрока.Имя = "Валюта";
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипОбъектаДО = "Справочник.Мероприятия" Тогда
		
		НоваяСтрока = ОбязательныеРеквизиты.Добавить();
		НоваяСтрока.Имя = "Организатор";
		
		НайденныеСтроки = ОбязательныеРеквизиты.НайтиСтроки(
			Новый Структура("Таблица", "Программа"));
		Для Каждого Строка Из НайденныеСтроки Цикл
			ОбязательныеРеквизиты.Удалить(Строка);
		КонецЦикла;
		
		НайденныеСтроки = ОбязательныеРеквизиты.НайтиСтроки(
			Новый Структура("Таблица", "Протокол"));
		Для Каждого Строка Из НайденныеСтроки Цикл
			ОбязательныеРеквизиты.Удалить(Строка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Позволяет переопределить предельное количество объектов, которые будут выгружены в сообщение
// обмена с интегрированной системой.
//
// Параметры:
//   ПредельноеКоличествоОбъектовВСообщении - Число - предельное количество объектов.
//
// Пример:
//	ПредельноеКоличествоОбъектовВСообщении = 100;
//
Процедура ПриОпределенииПредельногоКоличестваОбъектовВСообщенииОбмена(ПредельноеКоличествоОбъектовВСообщении) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при определении таймаута веб-сервиса. При необходимости таймаут может быть вынесен в
// настройки администратора интеграции и переопределен в этой процедуре.
//
// Параметры:
//   Таймаут - Число - неявно возвращаемое значение, время в секундах, по истечении которого вызов
//     веб-сервиса Документооборота считается неудачным.
//
Процедура ПриОпределенииТаймаутаСервиса(Таймаут) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при получении WSПрокси. Переопределяется, если в конфигурации есть возможность настройки интернет-прокси.
//
// Параметры:
//   ИнтернетПрокси - Неопределено - неявно возвращаемое значение, может быть инициализировано значением
//     типа ИнтернетПрокси.
//
Процедура ПриПолученииWSПрокси(ИнтернетПрокси) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при создании защищенного соединения для подключения к веб-сервису БИД. Переопределяется, если
// веб-сервис БИД использует защищенное https соединение, и для подключения к нему требуется использовать сертификаты.
//
// Параметры:
//   ЗащищенноеСоединение - Неопределено - неявно возвращаемое значение, может быть инициализировано значением
//     типа ЗащищенноеСоединениеOpenSSL.
//   МестоположениеWSDL - Строка - адрес веб-сервиса БИД.
//
Процедура ПриСозданииЗащищенногоСоединения(ЗащищенноеСоединение, МестоположениеWSDL) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
